1:PvP5thAge
00000000

<center>5th Age PvP Premiere League</center>
00000001

Spring $YEAR$
00000002

Must have a player at or above level 130\nCritial hits capped at 200 Rating\nShadow pip generation increased by 50%\nDamage limit is 200%\nResist limit set at 70%
00000003

1v1 Premiere
00000004

Winter $YEAR$
00000005

Premiere League
00000006

Must be Lvl 140 - 150 to compete\n"Incoming Healing" stat reduced\nNo Pre-Enchanted Cards
00000007

Exalted League
00000008

Must be Lvl 100 - 109 to compete\nShadow Pips Disabled\n"Incoming Healing" stat reduced\nNo Pre-Enchanted Cards
00000009

Master League
00000010

Must be Lvl 40 - 50 to compete\nCritical Hits Disabled\n"Incoming Healing" stat reduced\nNo Pre-Enchanted cards
00000011

5th Age Master League Season 1
00000012

<center>5th Age PvP Exalted League</center>
00000013

Exalted League Season 1
00000014

Premiere League Season 1
00000015

<center>PvP Match Rewards</center>
00000016

5th Age Master League Season 2
00000017

5th Age Master League Season 3
00000018

5th Age Master League Season 4
00000019

5th Age Master League Season 5
00000020

5th Age Master League Season 6
00000021

5th Age Master League Season 7
00000022

5th Age Master League Season 8
00000023

5th Age Master League Season 9
00000024

5th Age Master League Season 10
00000025

5th Age Master League Season 11
00000026

Season Test
00000027

Test Season 3
00000028

Premiere Test
00000029

<center>5th Age PvP Master League</center>
00000030

Resist limit 60%
00000031

Resist limit 65%
00000032

Legendary League
00000033

Must be Lvl 60-69 to compete\nCritical Hits Disabled\n"Incoming Healing" stat reduced\nNo Pre-Enchanted cards
00000034

April 2022
00000035

June 2022
00000036

August 2022
00000037

October 2022
00000038

January 2023
00000039

<center>5th Age PvP Legendary League</center>
00000040

Test Season 2
00000041

March 2023
00000042

December 2022
